Ruby/RubyLab7/app/controllers/book_controller.rb

SELECT "students".* FROM "students"
---
  def new
    @students = Student.all

INSERT INTO "books" ("name", "issue_date", "order_date", "student_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Math"], ["issue_date", "2022-12-01"], ["order_date", "2022-11-01"], ["student_id", 21], ["created_at", "2022-11-20 23:04:45.273438"], ["updated_at", "2022-11-20 23:04:45.273438"]]
---
  def create
    Book.create(
      name: params[:book][:name],
      issue_date: params[:book][:issue_date].to_s,
      order_date: params[:book][:order_date].to_s,
      student_id: params[:student_id]
    )

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
SELECT "students".* FROM "students"
---
  def edit
    @book = Book.find(params[:id])
    @students = Student.all

SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 31], ["LIMIT", 1]]
UPDATE "books" SET "issue_date" = ?, "order_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["issue_date", "2022-11-24 01:34:00"], ["order_date", "2022-11-21 01:34:00"], ["updated_at", "2022-11-20 23:34:59.456389"], ["id", 10]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(name: params[:book][:name],
                    issue_date: params[:book][:issue_date].to_s,
                    order_date: params[:book][:order_date].to_s,
                    student_id: params[:student_id])