Ruby/RubyLab7/app/controllers/student_controller.rb

INSERT INTO "students" ("name", "surname", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", nil], ["surname", nil], ["created_at", "2022-11-20 17:58:07.715227"], ["updated_at", "2022-11-20 17:58:07.715227"]]
---
  def create
    Student.create(
      name: params[:name],
      surname: params[:surname]
    )

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "students" SET "surname" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["surname", "Zakharenko"], ["updated_at", "2022-11-20 21:30:45.616875"], ["id", 17]]
---
  def update
    @student = Student.find(params[:id])
    if @student.update(student_params)

SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "books".* FROM "books"
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 22]]
---
  def destroy
    @student = Student.find(params[:id])
    @books = Book.all
    Book.destroy_by(student_id: @student.id)
    @student.destroy