Ruby/RubyLab7/app/views/book/index.html.erb

          <td><%= book.name %></td>
          <td><%= Student.find(book.student_id).name %></td>
          <td><%= Student.find(book.student_id).surname %></td>
---
SELECT "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]